---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericNonFatalError
source: html/aa83d05c-01c7-9792-db77-b8e2c1204c79.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.GenericNonFatalError Property

A serious error has occurred. It is strongly recommended that you use Save As to save your work in a new file before continuing.

## Syntax (C#)
```csharp
public static FailureDefinitionId GenericNonFatalError { get; }
```